## Apply Function

In [1]:
# Import pandas library
import pandas as pd

In [2]:
df = pd.read_csv('Pandas Part 1/bigmart_data.csv')

In [3]:
df.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [4]:
# Access first row
df.apply(lambda x: x[0])

Item_Identifier                          FDA15
Item_Weight                                9.3
Item_Fat_Content                       Low Fat
Item_Visibility                      0.0160473
Item_Type                                Dairy
Item_MRP                               249.809
Outlet_Identifier                       OUT049
Outlet_Establishment_Year                 1999
Outlet_Size                             Medium
Outlet_Location_Type                    Tier 1
Outlet_Type                  Supermarket Type1
Item_Outlet_Sales                      3735.14
dtype: object

In [5]:
# Access third row
df.apply(lambda x: x[2])

Item_Identifier                          FDN15
Item_Weight                               17.5
Item_Fat_Content                       Low Fat
Item_Visibility                      0.0167601
Item_Type                                 Meat
Item_MRP                               141.618
Outlet_Identifier                       OUT049
Outlet_Establishment_Year                 1999
Outlet_Size                             Medium
Outlet_Location_Type                    Tier 1
Outlet_Type                  Supermarket Type1
Item_Outlet_Sales                      2097.27
dtype: object

In [6]:
# Access eighth column
df.apply(lambda x: x[7], axis=1)

0       1999
1       2009
2       1999
3       1998
4       1987
        ...
8518    1987
8519    2002
8520    2004
8521    2009
8522    1997
Length: 8523, dtype: int64

In [7]:
# Access 'Item_Weight' column
df.apply(lambda x: x['Item_Weight'], axis=1)

0        9.300
1        5.920
2       17.500
3       19.200
4        8.930
         ...
8518     6.865
8519     8.380
8520    10.600
8521     7.210
8522    14.800
Length: 8523, dtype: float64

In [8]:
# Access first column
df.apply(lambda x: x[0], axis=1)

0       FDA15
1       DRC01
2       FDN15
3       FDX07
4       NCD19
        ...
8518    FDF22
8519    FDS36
8520    NCJ29
8521    FDN46
8522    DRG01
Length: 8523, dtype: object

In [9]:
def reset(price):
    if price<200:
        price= 100
    return price

In [10]:
df['Item_MRP'].apply(lambda x: reset(x)).head()

0    249.8092
1    100.0000
2    100.0000
3    100.0000
4    100.0000
Name: Item_MRP, dtype: float64

In [11]:
def tier(city):
    if city == 'Tier 1':
        value = 0
    elif city == 'Tier 2':
        value = 1
    else:
        value = 2

    return value

In [12]:
df['Outlet_Location_Type'].apply(lambda x: tier(x)).head()

0    0
1    2
2    0
3    2
4    2
Name: Outlet_Location_Type, dtype: int64

In [13]:
def category(weight):
    if weight > 20:
        weight = 'Heavy'
    elif weight <20 and weight>10:
        weight = 'Medium'
    else:
        weight = 'Light'

    return weight

In [14]:
df['Item_Weight'].apply(lambda x: category(x)).head()

0     Light
1     Light
2    Medium
3    Medium
4     Light
Name: Item_Weight, dtype: object

In [15]:
def sales(price):
    if price>2000:
        price = 'High Sales'
    else:
        price = 'Less Sales'
    return price

In [16]:
df['Item_Outlet_Sales'].apply(lambda x: sales(x))

0       High Sales
1       Less Sales
2       High Sales
3       Less Sales
4       Less Sales
           ...
8518    High Sales
8519    Less Sales
8520    Less Sales
8521    Less Sales
8522    Less Sales
Name: Item_Outlet_Sales, Length: 8523, dtype: object

In [17]:
df['Outlet_Size'].head()

0    Medium
1    Medium
2    Medium
3       NaN
4      High
Name: Outlet_Size, dtype: object

In [18]:
def size(outlet):
    if outlet == 'High':
       value = 2

    elif outlet == 'Medium':
        value = 1

    else:
        value = 0

    return value

In [19]:
df['Outlet_Size'].apply(lambda x: size(x)).head()

0    1
1    1
2    1
3    0
4    2
Name: Outlet_Size, dtype: int64

In [20]:
# Aggregation

In [21]:
# import libraries
import pandas as pd
import numpy as np

In [22]:
# read dataset
df = pd.read_csv('Pandas Part 1/bigmart_data.csv')

In [23]:
df.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [24]:
price_by_item = df.groupby('Item_Type')

In [25]:
price_by_item.Item_MRP.mean()

Item_Type
Baking Goods             126.380766
Breads                   140.952669
Breakfast                141.788151
Canned                   139.763832
Dairy                    148.499208
Frozen Foods             138.503366
Fruits and Vegetables    144.581235
Hard Drinks              137.077928
Health and Hygiene       130.818921
Household                149.424753
Meat                     139.882032
Others                   132.851430
Seafood                  141.841719
Snack Foods              146.194934
Soft Drinks              131.492506
Starchy Foods            147.838023
Name: Item_MRP, dtype: float64

In [26]:
price_by_item.Item_MRP.min()

Item_Type
Baking Goods             33.9874
Breads                   31.9558
Breakfast                40.0480
Canned                   36.3506
Dairy                    33.4874
Frozen Foods             31.9558
Fruits and Vegetables    36.2506
Hard Drinks              34.2532
Health and Hygiene       33.1216
Household                32.4558
Meat                     34.7532
Others                   35.0190
Seafood                  33.7216
Snack Foods              32.3558
Soft Drinks              31.2900
Starchy Foods            34.0532
Name: Item_MRP, dtype: float64

In [27]:
price_by_item.Item_MRP.max()

Item_Type
Baking Goods             265.5568
Breads                   263.6594
Breakfast                234.9300
Canned                   266.8884
Dairy                    266.6884
Frozen Foods             264.8910
Fruits and Vegetables    264.2252
Hard Drinks              261.4278
Health and Hygiene       266.6884
Household                264.7910
Meat                     261.5936
Others                   254.9040
Seafood                  240.2880
Snack Foods              264.9568
Soft Drinks              263.5910
Starchy Foods            263.0252
Name: Item_MRP, dtype: float64

In [28]:
multi_group = df.groupby(['Item_Type','Outlet_Location_Type'])

In [29]:
multi_group.first().head(9)

                                  Item_Identifier  Item_Weight  \
Item_Type    Outlet_Location_Type
Baking Goods Tier 1                         FDC37       15.850
             Tier 2                         FDG12        6.635
             Tier 3                         FDP36       10.395
Breads       Tier 1                         FDW35        9.600
             Tier 2                         FDO23       17.850
             Tier 3                         FDW11       12.600
Breakfast    Tier 1                         FDP49        9.000
             Tier 2                         FDN13       18.600
             Tier 3                         FDQ49       20.750

                                  Item_Fat_Content  Item_Visibility  Item_MRP  \
Item_Type    Outlet_Location_Type
Baking Goods Tier 1                        Low Fat         0.057557  107.6938
             Tier 2                        Regular         0.000000  121.3098
             Tier 3                        Regular         0.000000   51.4008
Breads       Tier 1                        low fat         0.019416   41.6454
             Tier 2                        Low Fat         0.000000   93.1436
             Tier 3                        Low Fat         0.048981   61.9194
Breakfast    Tier 1                        Regular         0.069089   56.3614
             Tier 2                        Low Fat         0.152918   99.8358
             Tier 3                        Regular         0.039058  155.9630

                                  Outlet_Identifier  \
Item_Type    Outlet_Location_Type
Baking Goods Tier 1                          OUT019
             Tier 2                          OUT045
             Tier 3                          OUT018
Breads       Tier 1                          OUT019
             Tier 2                          OUT045
             Tier 3                          OUT018
Breakfast    Tier 1                          OUT046
             Tier 2                          OUT017
             Tier 3                          OUT027

                                   Outlet_Establishment_Year Outlet_Size  \
Item_Type    Outlet_Location_Type
Baking Goods Tier 1                                     1985       Small
             Tier 2                                     2002       Small
             Tier 3                                     2009      Medium
Breads       Tier 1                                     1985       Small
             Tier 2                                     2002       Small
             Tier 3                                     2009      Medium
Breakfast    Tier 1                                     1997       Small
             Tier 2                                     2007       Small
             Tier 3                                     1985      Medium

                                         Outlet_Type  Item_Outlet_Sales
Item_Type    Outlet_Location_Type
Baking Goods Tier 1                    Grocery Store           214.3876
             Tier 2                Supermarket Type1          2530.7058
             Tier 3                Supermarket Type2           556.6088
Breads       Tier 1                    Grocery Store            83.8908
             Tier 2                Supermarket Type1          2174.5028
             Tier 3                Supermarket Type2           619.1940
Breakfast    Tier 1                Supermarket Type1          1547.3192
             Tier 2                Supermarket Type1          1910.1802
             Tier 3                Supermarket Type3          3285.7230

In [30]:
multi_group.Item_Outlet_Sales.mean().head(9)

Item_Type     Outlet_Location_Type
Baking Goods  Tier 1                  1766.342208
              Tier 2                  2052.633001
              Tier 3                  2006.533613
Breads        Tier 1                  2049.382087
              Tier 2                  2275.347721
              Tier 3                  2247.993804
Breakfast     Tier 1                  1532.631248
              Tier 2                  2417.394963
              Tier 3                  2319.232924
Name: Item_Outlet_Sales, dtype: float64

## Crosstab

In [31]:
pd.crosstab(df['Item_Type'],df['Outlet_Location_Type'])

Outlet_Location_Type   Tier 1  Tier 2  Tier 3
Item_Type
Baking Goods              185     211     252
Breads                     67      84     100
Breakfast                  33      32      45
Canned                    177     222     250
Dairy                     205     214     263
Frozen Foods              250     279     327
Fruits and Vegetables     337     399     496
Hard Drinks                58      72      84
Health and Hygiene        138     166     216
Household                 250     296     364
Meat                      123     125     177
Others                     56      52      61
Seafood                    19      22      23
Snack Foods               334     401     465
Soft Drinks               120     157     168
Starchy Foods              36      53      59

In [32]:
pd.crosstab(df['Outlet_Size'],df['Outlet_Location_Type'])

Outlet_Location_Type  Tier 1  Tier 2  Tier 3
Outlet_Size
High                       0       0     932
Medium                   930       0    1863
Small                   1458     930       0

## Pivot table

In [33]:
pd.pivot_table(df, index=['Outlet_Establishment_Year'],values='Item_Outlet_Sales')

                           Item_Outlet_Sales
Outlet_Establishment_Year
1985                             2483.677474
1987                             2298.995256
1997                             2277.844267
1998                              339.351662
1999                             2348.354635
2002                             2192.384798
2004                             2438.841866
2007                             2340.675263
2009                             1995.498739

In [34]:
pd.pivot_table(df, index=['Outlet_Establishment_Year'],values='Item_Outlet_Sales',aggfunc= min)

                           Item_Outlet_Sales
Outlet_Establishment_Year
1985                                 33.9558
1987                                 73.2380
1997                                101.8674
1998                                 33.2900
1999                                111.8544
2002                                 99.8700
2004                                113.8518
2007                                143.8128
2009                                 69.2432

In [35]:
pd.pivot_table(df, index=['Outlet_Establishment_Year'],values='Item_Outlet_Sales',aggfunc= max)

                           Item_Outlet_Sales
Outlet_Establishment_Year
1985                              13086.9648
1987                              10256.6490
1997                               9779.9362
1998                               1775.6886
1999                               7646.0472
2002                               8994.9580
2004                               8479.6288
2007                               9664.7528
2009                               6768.5228

In [36]:
pd.pivot_table(df, index=['Outlet_Establishment_Year'],values='Item_Outlet_Sales',aggfunc= [min,max,sum,np.mean, np.median, np.std])

,min,max,sum,mean,median,std
,Item_Outlet_Sales,Item_Outlet_Sales,Item_Outlet_Sales,Item_Outlet_Sales,Item_Outlet_Sales,Item_Outlet_Sales
Outlet_Establishment_Year,,,,,,
1985,33.9558,13086.9648,3.633620e+06,2483.677474,1845.5976,2347.516621
1987,73.2380,10256.6490,2.142664e+06,2298.995256,2050.6640,1533.531664
1997,101.8674,9779.9362,2.118395e+06,2277.844267,1945.8005,1488.405631
1998,33.2900,1775.6886,1.883402e+05,339.351662,250.3408,271.014855
1999,111.8544,7646.0472,2.183970e+06,2348.354635,1966.1074,1513.289464
2002,99.8700,8994.9580,2.036725e+06,2192.384798,1834.9448,1462.399658
2004,113.8518,8479.6288,2.268123e+06,2438.841866,2109.2544,1538.512533
2007,143.8128,9664.7528,2.167465e+06,2340.675263,2005.0567,1550.778025
2009,69.2432,6768.5228,1.851823e+06,1995.498739,1655.1788,1375.932889

In [37]:
pd.pivot_table(df, index =['Outlet_Establishment_Year', 'Outlet_Location_Type', 'Outlet_Size'], values ='Item_Outlet_Sales')

                                                            Item_Outlet_Sales
Outlet_Establishment_Year Outlet_Location_Type Outlet_Size
1985                      Tier 1               Small               340.329723
                          Tier 3               Medium             3694.038558
1987                      Tier 3               High               2298.995256
1997                      Tier 1               Small              2277.844267
1999                      Tier 1               Medium             2348.354635
2004                      Tier 2               Small              2438.841866
2009                      Tier 3               Medium             1995.498739

In [38]:
pd.pivot_table(df, index =['Outlet_Establishment_Year', 'Outlet_Location_Type', 'Outlet_Size'], values ='Item_Outlet_Sales',aggfunc= [min,max,sum,np.mean, np.median, np.std])

                                                                         min  \
                                                           Item_Outlet_Sales
Outlet_Establishment_Year Outlet_Location_Type Outlet_Size
1985                      Tier 1               Small                 33.9558
                          Tier 3               Medium               241.6854
1987                      Tier 3               High                  73.2380
1997                      Tier 1               Small                101.8674
1999                      Tier 1               Medium               111.8544
2004                      Tier 2               Small                113.8518
2009                      Tier 3               Medium                69.2432

                                                                         max  \
                                                           Item_Outlet_Sales
Outlet_Establishment_Year Outlet_Location_Type Outlet_Size
1985                      Tier 1               Small               1482.0708
                          Tier 3               Medium             13086.9648
1987                      Tier 3               High               10256.6490
1997                      Tier 1               Small               9779.9362
1999                      Tier 1               Medium              7646.0472
2004                      Tier 2               Small               8479.6288
2009                      Tier 3               Medium              6768.5228

                                                                         sum  \
                                                           Item_Outlet_Sales
Outlet_Establishment_Year Outlet_Location_Type Outlet_Size
1985                      Tier 1               Small            1.796941e+05
                          Tier 3               Medium           3.453926e+06
1987                      Tier 3               High             2.142664e+06
1997                      Tier 1               Small            2.118395e+06
1999                      Tier 1               Medium           2.183970e+06
2004                      Tier 2               Small            2.268123e+06
2009                      Tier 3               Medium           1.851823e+06

                                                                        mean  \
                                                           Item_Outlet_Sales
Outlet_Establishment_Year Outlet_Location_Type Outlet_Size
1985                      Tier 1               Small              340.329723
                          Tier 3               Medium            3694.038558
1987                      Tier 3               High              2298.995256
1997                      Tier 1               Small             2277.844267
1999                      Tier 1               Medium            2348.354635
2004                      Tier 2               Small             2438.841866
2009                      Tier 3               Medium            1995.498739

                                                                      median  \
                                                           Item_Outlet_Sales
Outlet_Establishment_Year Outlet_Location_Type Outlet_Size
1985                      Tier 1               Small                265.3213
                          Tier 3               Medium              3364.9532
1987                      Tier 3               High                2050.6640
1997                      Tier 1               Small               1945.8005
1999                      Tier 1               Medium              1966.1074
2004                      Tier 2               Small               2109.2544
2009                      Tier 3               Medium              1655.1788

                                                                         std
                                                           Item_Outlet_Sales
Outlet_Establishment_Year Outlet_Location_Type Outlet_Size
1985                      Tier 1               Small              249.979449
                          Tier 3               Medium            2127.760054
1987                      Tier 3               High              1533.531664
1997                      Tier 1               Small             1488.405631
1999                      Tier 1               Medium            1513.289464
2004                      Tier 2               Small             1538.512533
2009                      Tier 3               Medium            1375.932889